TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Ale.h
/*
 * TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 * Copyright (c) 2022-2025 Texas Instruments Incorporated
 *
 * All rights reserved not granted herein.
 *
 * Limited License.
 *
 * Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 * license under copyrights and patents it now or hereafter owns or controls to
 * make, have made, use, import, offer to sell and sell ("Utilize") this software
 * subject to the terms herein. With respect to the foregoing patent license,
 * such license is granted solely to the extent that any such patent is necessary
 * to Utilize the software alone. The patent license shall not apply to any
 * combinations which include this software, other than combinations with devices
 * manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 * Redistributions must preserve existing copyright notices and reproduce this license
 * (including the above copyright notice and the disclaimer and (if applicable) source
 * code license limitations below) in the documentation and/or other materials provided
 * with the distribution.
 *
 * Redistribution and use in binary form, without modification, are permitted provided
 * that the following conditions are met:
 * No reverse engineering, decompilation, or disassembly of this software is
 * permitted with respect to any software provided in binary form.
 * Any redistribution and use are licensed by TI for use only with TI Devices.
 * Nothing shall obligate TI to provide you with source code for the software
 * licensed and provided to you in object code.
 *
 * If software source code is provided to you, modification and redistribution of the
 * source code are permitted provided that the following conditions are met:
 * Any redistribution and use of the source code, including any resulting derivative
 * works, are licensed by TI for use only with TI Devices.
 * Any redistribution and use of any object code compiled from the source code
 * and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * DISCLAIMER.
 *
 * THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 * LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 * Hw_Cpsw_Ale.h
 *
 * Register-level header file for CPSW_ALE
 */

#ifndef HW_CPSW_ALE_H_
#define HW_CPSW_ALE_H_

#ifdef __cplusplus
extern "C"
{
#endif


/*******************************************************************************
* Register Definitions
*******************************************************************************/
#define CPSW_ALE_IDVER_REG                                       (0x0003E000U)
#define CPSW_ALE_STATUS_REG                                      (0x0003E004U)
#define CPSW_ALE_CONTROL_REG                                     (0x0003E008U)
#define CPSW_ALE_CONTROL2_REG                                    (0x0003E00CU)
#define CPSW_ALE_PRESCALE_REG                                    (0x0003E010U)
#define CPSW_ALE_AGING_TIMER_REG                                 (0x0003E014U)
#define CPSW_ALE_TABLE_CONTROL_REG                               (0x0003E020U)
#define CPSW_ALE_TBLW2_REG                                       (0x0003E034U)
#define CPSW_ALE_TBLW1_REG                                       (0x0003E038U)
#define CPSW_ALE_TBLW0_REG                                       (0x0003E03CU)
#define CPSW_ALE_PORT_CONTROL_REG(PORT_CONTROL_REG)              (0x0003E040U+((PORT_CONTROL_REG)*0x4U))
#define CPSW_ALE_UNKNOWN_VLAN_REG                                (0x0003E090U)
#define CPSW_ALE_UNKNOWN_MCAST_FLOOD_REG                         (0x0003E094U)
#define CPSW_ALE_UNKNOWN_REG_MCAST_FLOOD_REG                     (0x0003E098U)
#define CPSW_ALE_FORCE_UNTAGGED_EGRESS_REG                       (0x0003E09CU)
#define CPSW_ALE_VLAN_MASK_MUX0_REG                              (0x0003E0C0U)
#define CPSW_ALE_VLAN_MASK_MUX1_REG                              (0x0003E0C4U)
#define CPSW_ALE_VLAN_MASK_MUX2_REG                              (0x0003E0C8U)
#define CPSW_ALE_VLAN_MASK_MUX3_REG                              (0x0003E0CCU)
#define CPSW_ALE_VLAN_MASK_MUX4_REG                              (0x0003E0D0U)
#define CPSW_ALE_VLAN_MASK_MUX5_REG                              (0x0003E0D4U)
#define CPSW_ALE_VLAN_MASK_MUX6_REG                              (0x0003E0D8U)
#define CPSW_ALE_VLAN_MASK_MUX7_REG                              (0x0003E0DCU)
#define CPSW_ALE_POLICER_PORT_OUI_REG                            (0x0003E100U)
#define CPSW_ALE_POLICER_DA_SA_REG                               (0x0003E104U)
#define CPSW_ALE_POLICER_VLAN_REG                                (0x0003E108U)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG                      (0x0003E10CU)
#define CPSW_ALE_POLICER_IPDA_REG                                (0x0003E110U)
#define CPSW_ALE_POLICER_PIR_REG                                 (0x0003E118U)
#define CPSW_ALE_POLICER_CIR_REG                                 (0x0003E11CU)
#define CPSW_ALE_POLICER_TBL_CTL_REG                             (0x0003E120U)
#define CPSW_ALE_POLICER_CTL_REG                                 (0x0003E124U)
#define CPSW_ALE_POLICER_TEST_CTL_REG                            (0x0003E128U)
#define CPSW_ALE_POLICER_HIT_STATUS_REG                          (0x0003E12CU)
#define CPSW_ALE_THREAD_DEF_REG                                  (0x0003E134U)
#define CPSW_ALE_THREAD_CTL_REG                                  (0x0003E138U)
#define CPSW_ALE_THREAD_VAL_REG                                  (0x0003E13CU)

