TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Ale.h
/*******************************************************************************
* Field Definition Macros
*******************************************************************************/
/* IDVER_REG */

#define CPSW_ALE_IDVER_REG_MINOR_VER_MASK                        (0x000000FFU)
#define CPSW_ALE_IDVER_REG_MINOR_VER_SHIFT                       (0x00000000U)
#define CPSW_ALE_IDVER_REG_MINOR_VER_MAX                         (0x000000FFU)

#define CPSW_ALE_IDVER_REG_MAJOR_VER_MASK                        (0x00000700U)
#define CPSW_ALE_IDVER_REG_MAJOR_VER_SHIFT                       (0x00000008U)
#define CPSW_ALE_IDVER_REG_MAJOR_VER_MAX                         (0x00000007U)

#define CPSW_ALE_IDVER_REG_RTL_VER_MASK                          (0x0000F800U)
#define CPSW_ALE_IDVER_REG_RTL_VER_SHIFT                         (0x0000000BU)
#define CPSW_ALE_IDVER_REG_RTL_VER_MAX                           (0x0000001FU)

#define CPSW_ALE_IDVER_REG_IDENT_MASK                            (0xFFFF0000U)
#define CPSW_ALE_IDVER_REG_IDENT_SHIFT                           (0x00000010U)
#define CPSW_ALE_IDVER_REG_IDENT_MAX                             (0x0000FFFFU)

/* STATUS_REG */

#define CPSW_ALE_STATUS_REG_ENTRIES_DIV_1024_MASK                (0x000000FFU)
#define CPSW_ALE_STATUS_REG_ENTRIES_DIV_1024_SHIFT               (0x00000000U)
#define CPSW_ALE_STATUS_REG_ENTRIES_DIV_1024_MAX                 (0x000000FFU)

#define CPSW_ALE_STATUS_REG_POLICERS_DIV_8_MASK                  (0x0000FF00U)
#define CPSW_ALE_STATUS_REG_POLICERS_DIV_8_SHIFT                 (0x00000008U)
#define CPSW_ALE_STATUS_REG_POLICERS_DIV_8_MAX                   (0x000000FFU)

/* CONTROL_REG */

#define CPSW_ALE_CONTROL_REG_ENABLE_RATE_LIMIT_MASK              (0x00000001U)
#define CPSW_ALE_CONTROL_REG_ENABLE_RATE_LIMIT_SHIFT             (0x00000000U)
#define CPSW_ALE_CONTROL_REG_ENABLE_RATE_LIMIT_MAX               (0x00000001U)

#define CPSW_ALE_CONTROL_REG_ENABLE_AUTH_MODE_MASK               (0x00000002U)
#define CPSW_ALE_CONTROL_REG_ENABLE_AUTH_MODE_SHIFT              (0x00000001U)
#define CPSW_ALE_CONTROL_REG_ENABLE_AUTH_MODE_MAX                (0x00000001U)

#define CPSW_ALE_CONTROL_REG_VLAN_AWARE_MASK                     (0x00000004U)
#define CPSW_ALE_CONTROL_REG_VLAN_AWARE_SHIFT                    (0x00000002U)
#define CPSW_ALE_CONTROL_REG_VLAN_AWARE_MAX                      (0x00000001U)

#define CPSW_ALE_CONTROL_REG_RATE_LIMIT_TX_MASK                  (0x00000008U)
#define CPSW_ALE_CONTROL_REG_RATE_LIMIT_TX_SHIFT                 (0x00000003U)
#define CPSW_ALE_CONTROL_REG_RATE_LIMIT_TX_MAX                   (0x00000001U)

#define CPSW_ALE_CONTROL_REG_BYPASS_MASK                         (0x00000010U)
#define CPSW_ALE_CONTROL_REG_BYPASS_SHIFT                        (0x00000004U)
#define CPSW_ALE_CONTROL_REG_BYPASS_MAX                          (0x00000001U)

#define CPSW_ALE_CONTROL_REG_ENABLE_OUI_DENY_MASK                (0x00000020U)
#define CPSW_ALE_CONTROL_REG_ENABLE_OUI_DENY_SHIFT               (0x00000005U)
#define CPSW_ALE_CONTROL_REG_ENABLE_OUI_DENY_MAX                 (0x00000001U)

#define CPSW_ALE_CONTROL_REG_EN_VID0_MODE_MASK                   (0x00000040U)
#define CPSW_ALE_CONTROL_REG_EN_VID0_MODE_SHIFT                  (0x00000006U)
#define CPSW_ALE_CONTROL_REG_EN_VID0_MODE_MAX                    (0x00000001U)

#define CPSW_ALE_CONTROL_REG_LEARN_NO_VID_MASK                   (0x00000080U)
#define CPSW_ALE_CONTROL_REG_LEARN_NO_VID_SHIFT                  (0x00000007U)
#define CPSW_ALE_CONTROL_REG_LEARN_NO_VID_MAX                    (0x00000001U)

#define CPSW_ALE_CONTROL_REG_UNI_FLOOD_TO_HOST_MASK              (0x00000100U)
#define CPSW_ALE_CONTROL_REG_UNI_FLOOD_TO_HOST_SHIFT             (0x00000008U)
#define CPSW_ALE_CONTROL_REG_UNI_FLOOD_TO_HOST_MAX               (0x00000001U)

#define CPSW_ALE_CONTROL_REG_MIRROR_SEN_MASK                     (0x00000400U)
#define CPSW_ALE_CONTROL_REG_MIRROR_SEN_SHIFT                    (0x0000000AU)
#define CPSW_ALE_CONTROL_REG_MIRROR_SEN_MAX                      (0x00000001U)

#define CPSW_ALE_CONTROL_REG_MIRROR_DEN_MASK                     (0x00000800U)
#define CPSW_ALE_CONTROL_REG_MIRROR_DEN_SHIFT                    (0x0000000BU)
#define CPSW_ALE_CONTROL_REG_MIRROR_DEN_MAX                      (0x00000001U)

#define CPSW_ALE_CONTROL_REG_MIRROR_MEN_MASK                     (0x00001000U)
#define CPSW_ALE_CONTROL_REG_MIRROR_MEN_SHIFT                    (0x0000000CU)
#define CPSW_ALE_CONTROL_REG_MIRROR_MEN_MAX                      (0x00000001U)

#define CPSW_ALE_CONTROL_REG_UVLAN_NO_LEARN_MASK                 (0x00002000U)
#define CPSW_ALE_CONTROL_REG_UVLAN_NO_LEARN_SHIFT                (0x0000000DU)
#define CPSW_ALE_CONTROL_REG_UVLAN_NO_LEARN_MAX                  (0x00000001U)

#define CPSW_ALE_CONTROL_REG_REG_UPD_STATIC_MASK                 (0x00008000U)
#define CPSW_ALE_CONTROL_REG_REG_UPD_STATIC_SHIFT                (0x0000000FU)
#define CPSW_ALE_CONTROL_REG_REG_UPD_STATIC_MAX                  (0x00000001U)

#define CPSW_ALE_CONTROL_REG_MIRROR_TOP_MASK                     (0x00010000U)
#define CPSW_ALE_CONTROL_REG_MIRROR_TOP_SHIFT                    (0x00000010U)
#define CPSW_ALE_CONTROL_REG_MIRROR_TOP_MAX                      (0x00000001U)

#define CPSW_ALE_CONTROL_REG_UPD_BW_CTL_MASK                     (0x00E00000U)
#define CPSW_ALE_CONTROL_REG_UPD_BW_CTL_SHIFT                    (0x00000015U)
#define CPSW_ALE_CONTROL_REG_UPD_BW_CTL_MAX                      (0x00000007U)

#define CPSW_ALE_CONTROL_REG_MIRROR_DP_MASK                      (0x01000000U)
#define CPSW_ALE_CONTROL_REG_MIRROR_DP_SHIFT                     (0x00000018U)
#define CPSW_ALE_CONTROL_REG_MIRROR_DP_MAX                       (0x00000001U)

#define CPSW_ALE_CONTROL_REG_AGE_OUT_NOW_MASK                    (0x20000000U)
#define CPSW_ALE_CONTROL_REG_AGE_OUT_NOW_SHIFT                   (0x0000001DU)
#define CPSW_ALE_CONTROL_REG_AGE_OUT_NOW_MAX                     (0x00000001U)

#define CPSW_ALE_CONTROL_REG_CLEAR_TABLE_MASK                    (0x40000000U)
#define CPSW_ALE_CONTROL_REG_CLEAR_TABLE_SHIFT                   (0x0000001EU)
#define CPSW_ALE_CONTROL_REG_CLEAR_TABLE_MAX                     (0x00000001U)

#define CPSW_ALE_CONTROL_REG_ENABLE_MASK                         (0x80000000U)
#define CPSW_ALE_CONTROL_REG_ENABLE_SHIFT                        (0x0000001FU)
#define CPSW_ALE_CONTROL_REG_ENABLE_MAX                          (0x00000001U)

/* CONTROL2_REG */

