TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Ale.h
#define CPSW_ALE_CONTROL2_REG_TRK_EN_DST_MASK                    (0x80000000U)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_DST_SHIFT                   (0x0000001FU)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_DST_MAX                     (0x00000001U)

#define CPSW_ALE_CONTROL2_REG_TRK_EN_SRC_MASK                    (0x40000000U)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_SRC_SHIFT                   (0x0000001EU)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_SRC_MAX                     (0x00000001U)

#define CPSW_ALE_CONTROL2_REG_TRK_EN_PRI_MASK                    (0x20000000U)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_PRI_SHIFT                   (0x0000001DU)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_PRI_MAX                     (0x00000001U)

#define CPSW_ALE_CONTROL2_REG_TRK_EN_VLAN_MASK                   (0x08000000U)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_VLAN_SHIFT                  (0x0000001BU)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_VLAN_MAX                    (0x00000001U)

#define CPSW_ALE_CONTROL2_REG_TRK_EN_SIP_MASK                    (0x02000000U)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_SIP_SHIFT                   (0x00000019U)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_SIP_MAX                     (0x00000001U)

#define CPSW_ALE_CONTROL2_REG_TRK_EN_DIP_MASK                    (0x01000000U)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_DIP_SHIFT                   (0x00000018U)
#define CPSW_ALE_CONTROL2_REG_TRK_EN_DIP_MAX                     (0x00000001U)

#define CPSW_ALE_CONTROL2_REG_TRK_BASE_MASK                      (0x00070000U)
#define CPSW_ALE_CONTROL2_REG_TRK_BASE_SHIFT                     (0x00000010U)
#define CPSW_ALE_CONTROL2_REG_TRK_BASE_MAX                       (0x00000007U)

#define CPSW_ALE_CONTROL2_REG_MIRROR_MIDX_MASK                   (0x0000003FU)
#define CPSW_ALE_CONTROL2_REG_MIRROR_MIDX_SHIFT                  (0x00000000U)
#define CPSW_ALE_CONTROL2_REG_MIRROR_MIDX_MAX                    (0x0000003FU)

/* PRESCALE_REG */

#define CPSW_ALE_PRESCALE_REG_PRESCALE_MASK                      (0x000FFFFFU)
#define CPSW_ALE_PRESCALE_REG_PRESCALE_SHIFT                     (0x00000000U)
#define CPSW_ALE_PRESCALE_REG_PRESCALE_MAX                       (0x000FFFFFU)

/* AGING_TIMER_REG */

#define CPSW_ALE_AGING_TIMER_REG_AGING_TIMER_MASK                (0x00FFFFFFU)
#define CPSW_ALE_AGING_TIMER_REG_AGING_TIMER_SHIFT               (0x00000000U)
#define CPSW_ALE_AGING_TIMER_REG_AGING_TIMER_MAX                 (0x00FFFFFFU)

#define CPSW_ALE_AGING_TIMER_REG_PRESCALE_2_DISABLE_MASK         (0x40000000U)
#define CPSW_ALE_AGING_TIMER_REG_PRESCALE_2_DISABLE_SHIFT        (0x0000001EU)
#define CPSW_ALE_AGING_TIMER_REG_PRESCALE_2_DISABLE_MAX          (0x00000001U)

#define CPSW_ALE_AGING_TIMER_REG_PRESCALE_1_DISABLE_MASK         (0x80000000U)
#define CPSW_ALE_AGING_TIMER_REG_PRESCALE_1_DISABLE_SHIFT        (0x0000001FU)
#define CPSW_ALE_AGING_TIMER_REG_PRESCALE_1_DISABLE_MAX          (0x00000001U)

/* TABLE_CONTROL_REG */

#define CPSW_ALE_TABLE_CONTROL_REG_ENTRY_POINTER_MASK            (0x000001FFU)
#define CPSW_ALE_TABLE_CONTROL_REG_ENTRY_POINTER_SHIFT           (0x00000000U)
#define CPSW_ALE_TABLE_CONTROL_REG_ENTRY_POINTER_MAX             (0x000001FFU)

#define CPSW_ALE_TABLE_CONTROL_REG_WRITE_RDZ_MASK                (0x80000000U)
#define CPSW_ALE_TABLE_CONTROL_REG_WRITE_RDZ_SHIFT               (0x0000001FU)
#define CPSW_ALE_TABLE_CONTROL_REG_WRITE_RDZ_MAX                 (0x00000001U)

/* TABLE_WORD_REG */

/* MAC address mask/shift values, used by ucast and mcast entries */
#define CPSW_ALE_TBLW0_REG_MACADDR_5_MASK                      (0x000000FFU)
#define CPSW_ALE_TBLW0_REG_MACADDR_5_SHIFT                     (0U)
#define CPSW_ALE_TBLW0_REG_MACADDR_4_MASK                      (0x0000FF00U)
#define CPSW_ALE_TBLW0_REG_MACADDR_4_SHIFT                     (8U)
#define CPSW_ALE_TBLW0_REG_MACADDR_3_MASK                      (0x00FF0000U)
#define CPSW_ALE_TBLW0_REG_MACADDR_3_SHIFT                     (16U)
#define CPSW_ALE_TBLW0_REG_MACADDR_2_MASK                      (0xFF000000U)
#define CPSW_ALE_TBLW0_REG_MACADDR_2_SHIFT                     (24U)
#define CPSW_ALE_TBLW1_REG_MACADDR_1_MASK                      (0x000000FFU)
#define CPSW_ALE_TBLW1_REG_MACADDR_1_SHIFT                     (0U)
#define CPSW_ALE_TBLW1_REG_MACADDR_0_MASK                      (0x0000FF00U)
#define CPSW_ALE_TBLW1_REG_MACADDR_0_SHIFT                     (8U)

#define CPSW_ALE_TBLW1_REG_ENTRY_TYPE_MASK                     (0x30000000U)
#define CPSW_ALE_TBLW1_REG_ENTRY_TYPE_SHIFT                    (28U)
#define CPSW_ALE_TBLW1_REG_ENTRY_VLAN_ID_MASK                  (0x0FFF0000U)
#define CPSW_ALE_TBLW1_REG_ENTRY_VLAN_ID_SHIFT                 (16U)

/** Multicast MAC address upper byte mask. */
#define CPSW_ALE_TBLW0_REG_VLAN_MEMBER_LIST_MASK               (0x00000007U)
#define CPSW_ALE_TBLW0_REG_VLAN_MEMBER_LIST_SHIFT              (0U)
#define CPSW_ALE_TBLW0_REG_VLAN_UNREG_MCAST_FLOOD_MASK_MASK    (0x00000700U)
#define CPSW_ALE_TBLW0_REG_VLAN_UNREG_MCAST_FLOOD_MASK_SHIFT   (8U)
#define CPSW_ALE_TBLW0_REG_VLAN_REG_MCAST_FLOOD_MASK_MASK      (0x00070000U)
#define CPSW_ALE_TBLW0_REG_VLAN_REG_MCAST_FLOOD_MASK_SHIFT     (16U)
#define CPSW_ALE_TBLW0_REG_VLAN_FORCE_UNTAGGED_EGRESS_MASK     (0x07000000U)
#define CPSW_ALE_TBLW0_REG_VLAN_FORCE_UNTAGGED_EGRESS_SHIFT    (24U)

/** Multicast MAC address upper byte mask. */
#define CPSW_ALE_TBLW0_REG_UNI_ADDR_31_0_MASK                  (0xFFFFFFFFU)
#define CPSW_ALE_TBLW0_REG_UNI_ADDR_31_0_SHIFT                 (0U)
#define CPSW_ALE_TBLW1_REG_UNI_ADDR_47_32_MASK                 (0x0000FFFFU)
#define CPSW_ALE_TBLW1_REG_UNI_ADDR_47_32_SHIFT                (0U)
#define CPSW_ALE_TBLW1_REG_UNI_ADDR_VLAN_ID_MASK               (0x0FFF0000U)
#define CPSW_ALE_TBLW1_REG_UNI_ADDR_VLAN_ID_SHIFT              (16U)
#define CPSW_ALE_TBLW1_REG_UNI_ADDR_TYPE_MASK                  (0xC0000000U)
#define CPSW_ALE_TBLW1_REG_UNI_ADDR_TYPE_SHIFT                 (30U)
#define CPSW_ALE_TBLW2_REG_UNI_ADDR_SECURE_MASK                (0x00000001U)
#define CPSW_ALE_TBLW2_REG_UNI_ADDR_SECURE_SHIFT               (0U)
#define CPSW_ALE_TBLW2_REG_UNI_ADDR_BLOCK_MASK                 (0x00000002U)
#define CPSW_ALE_TBLW2_REG_UNI_ADDR_BLOCK_SHIFT                (1U)
#define CPSW_ALE_TBLW2_REG_UNI_ADDR_PORT_NUM_MASK              (0x0000000CU)
#define CPSW_ALE_TBLW2_REG_UNI_ADDR_PORT_NUM_SHIFT             (2U)
#define CPSW_ALE_TBLW2_REG_UNI_ADDR_DLR_MASK                   (0x00000020U)
#define CPSW_ALE_TBLW2_REG_UNI_ADDR_DLR_SHIFT                  (5U)

/* Multicast MAC address upper byte mask. */
#define CPSW_ALE_TBLW0_REG_MULTI_ADDR_31_0_MASK                (0xFFFFFFFFU)
#define CPSW_ALE_TBLW0_REG_MULTI_ADDR_31_0_SHIFT               (0U)
#define CPSW_ALE_TBLW1_REG_MULTI_ADDR_47_32_MASK               (0x0000FFFFU)
#define CPSW_ALE_TBLW1_REG_MULTI_ADDR_47_32_SHIFT              (0U)
#define CPSW_ALE_TBLW1_REG_MULTI_ADDR_FWD_STATE_MASK           (0xC0000000U)
#define CPSW_ALE_TBLW1_REG_MULTI_ADDR_FWD_STATE_SHIFT          (30U)
#define CPSW_ALE_TBLW2_REG_MULTI_ADDR_SUPER_MASK               (0x00000002U)
#define CPSW_ALE_TBLW2_REG_MULTI_ADDR_SUPER_SHIFT              (1U)
#define CPSW_ALE_TBLW2_REG_MULTI_ADDR_PORT_MASK_MASK           (0x0000001CU)
#define CPSW_ALE_TBLW2_REG_MULTI_ADDR_PORT_MASK_SHIFT          (2U)

