TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Ale.h
/* PORT_CONTROL_REG */

#define CPSW_ALE_PORT_CONTROL_REG_PORT_STATE_MASK                (0x00000003U)
#define CPSW_ALE_PORT_CONTROL_REG_PORT_STATE_SHIFT               (0x00000000U)
#define CPSW_ALE_PORT_CONTROL_REG_PORT_STATE_MAX                 (0x00000003U)

#define CPSW_ALE_PORT_CONTROL_REG_DROP_UNTAGGED_MASK             (0x00000004U)
#define CPSW_ALE_PORT_CONTROL_REG_DROP_UNTAGGED_SHIFT            (0x00000002U)
#define CPSW_ALE_PORT_CONTROL_REG_DROP_UNTAGGED_MAX              (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_VID_INGRESS_CHECK_MASK         (0x00000008U)
#define CPSW_ALE_PORT_CONTROL_REG_VID_INGRESS_CHECK_SHIFT        (0x00000003U)
#define CPSW_ALE_PORT_CONTROL_REG_VID_INGRESS_CHECK_MAX          (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_NO_LEARN_MASK                  (0x00000010U)
#define CPSW_ALE_PORT_CONTROL_REG_NO_LEARN_SHIFT                 (0x00000004U)
#define CPSW_ALE_PORT_CONTROL_REG_NO_LEARN_MAX                   (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_NO_SA_UPDATE_MASK              (0x00000020U)
#define CPSW_ALE_PORT_CONTROL_REG_NO_SA_UPDATE_SHIFT             (0x00000005U)
#define CPSW_ALE_PORT_CONTROL_REG_NO_SA_UPDATE_MAX               (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_MIRROR_SP_MASK                 (0x00000080U)
#define CPSW_ALE_PORT_CONTROL_REG_MIRROR_SP_SHIFT                (0x00000007U)
#define CPSW_ALE_PORT_CONTROL_REG_MIRROR_SP_MAX                  (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_TRUNK_NUMBER_MASK              (0x00000300U)
#define CPSW_ALE_PORT_CONTROL_REG_TRUNK_NUMBER_SHIFT             (0x00000008U)
#define CPSW_ALE_PORT_CONTROL_REG_TRUNK_NUMBER_MAX               (0x00000003U)

#define CPSW_ALE_PORT_CONTROL_REG_TRUNK_EN_MASK                  (0x00000400U)
#define CPSW_ALE_PORT_CONTROL_REG_TRUNK_EN_SHIFT                 (0x0000000AU)
#define CPSW_ALE_PORT_CONTROL_REG_TRUNK_EN_MAX                   (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_MAC_ONLY_MASK                  (0x00000800U)
#define CPSW_ALE_PORT_CONTROL_REG_MAC_ONLY_SHIFT                 (0x0000000BU)
#define CPSW_ALE_PORT_CONTROL_REG_MAC_ONLY_MAX                   (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_DISABLE_AUTH_MODE_MASK         (0x00001000U)
#define CPSW_ALE_PORT_CONTROL_REG_DISABLE_AUTH_MODE_SHIFT        (0x0000000CU)
#define CPSW_ALE_PORT_CONTROL_REG_DISABLE_AUTH_MODE_MAX          (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_MAC_ONLY_CAF_MASK              (0x00002000U)
#define CPSW_ALE_PORT_CONTROL_REG_MAC_ONLY_CAF_SHIFT             (0x0000000DU)
#define CPSW_ALE_PORT_CONTROL_REG_MAC_ONLY_CAF_MAX               (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_DROP_DUAL_VLAN_MASK            (0x00004000U)
#define CPSW_ALE_PORT_CONTROL_REG_DROP_DUAL_VLAN_SHIFT           (0x0000000EU)
#define CPSW_ALE_PORT_CONTROL_REG_DROP_DUAL_VLAN_MAX             (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_DROP_DBL_VLAN_MASK             (0x00008000U)
#define CPSW_ALE_PORT_CONTROL_REG_DROP_DBL_VLAN_SHIFT            (0x0000000FU)
#define CPSW_ALE_PORT_CONTROL_REG_DROP_DBL_VLAN_MAX              (0x00000001U)

#define CPSW_ALE_PORT_CONTROL_REG_MCAST_LIMIT_MASK               (0x00FF0000U)
#define CPSW_ALE_PORT_CONTROL_REG_MCAST_LIMIT_SHIFT              (0x00000010U)
#define CPSW_ALE_PORT_CONTROL_REG_MCAST_LIMIT_MAX                (0x000000FFU)

#define CPSW_ALE_PORT_CONTROL_REG_BCAST_LIMIT_MASK               (0xFF000000U)
#define CPSW_ALE_PORT_CONTROL_REG_BCAST_LIMIT_SHIFT              (0x00000018U)
#define CPSW_ALE_PORT_CONTROL_REG_BCAST_LIMIT_MAX                (0x000000FFU)

/* UNKNOWN_VLAN_REG */
#define CPSW_ALE_UNKNOWN_VLAN_REG_LIST_MASK                      CPSW_ALE_PORT_MASK
#define CPSW_ALE_UNKNOWN_VLAN_REG_LIST_SHIFT                     (0x00000000U)
#define CPSW_ALE_UNKNOWN_VLAN_REG_LIST_MAX                       CPSW_ALE_PORT_MASK

/* UNKNOWN_MCAST_FLOOD_REG */

#define CPSW_ALE_UNKNOWN_MCAST_FLOOD_REG_MASK_MASK               CPSW_ALE_PORT_MASK
#define CPSW_ALE_UNKNOWN_MCAST_FLOOD_REG_MASK_SHIFT              (0x00000000U)
#define CPSW_ALE_UNKNOWN_MCAST_FLOOD_REG_MASK_MAX                CPSW_ALE_PORT_MASK

/* UNKNOWN_REG_MCAST_FLOOD_REG */

#define CPSW_ALE_UNKNOWN_REG_MCAST_FLOOD_REG_MASK_MASK           CPSW_ALE_PORT_MASK
#define CPSW_ALE_UNKNOWN_REG_MCAST_FLOOD_REG_MASK_SHIFT          (0x00000000U)
#define CPSW_ALE_UNKNOWN_REG_MCAST_FLOOD_REG_MASK_MAX            CPSW_ALE_PORT_MASK

/* FORCE_UNTAGGED_EGRESS_REG */

#define CPSW_ALE_FORCE_UNTAGGED_EGRESS_REG_MASK_MASK             CPSW_ALE_PORT_MASK
#define CPSW_ALE_FORCE_UNTAGGED_EGRESS_REG_MASK_SHIFT            (0x00000000U)
#define CPSW_ALE_FORCE_UNTAGGED_EGRESS_REG_MASK_MAX              CPSW_ALE_PORT_MASK

/* VLAN_MASK_MUX0_REG */

#define CPSW_ALE_VLAN_MASK_MUX0_REG_MASK_MASK                    CPSW_ALE_PORT_MASK
#define CPSW_ALE_VLAN_MASK_MUX0_REG_MASK_SHIFT                   (0x00000000U)
#define CPSW_ALE_VLAN_MASK_MUX0_REG_MASK_MAX                     CPSW_ALE_PORT_MASK

/* VLAN_MASK_MUX1_REG */

#define CPSW_ALE_VLAN_MASK_MUX1_REG_MASK_MASK                    CPSW_ALE_PORT_MASK
#define CPSW_ALE_VLAN_MASK_MUX1_REG_MASK_SHIFT                   (0x00000000U)
#define CPSW_ALE_VLAN_MASK_MUX1_REG_MASK_MAX                     CPSW_ALE_PORT_MASK

/* VLAN_MASK_MUX2_REG */

#define CPSW_ALE_VLAN_MASK_MUX2_REG_MASK_MASK                    CPSW_ALE_PORT_MASK
#define CPSW_ALE_VLAN_MASK_MUX2_REG_MASK_SHIFT                   (0x00000000U)
#define CPSW_ALE_VLAN_MASK_MUX2_REG_MASK_MAX                     CPSW_ALE_PORT_MASK

/* VLAN_MASK_MUX3_REG */

#define CPSW_ALE_VLAN_MASK_MUX3_REG_MASK_MASK                    CPSW_ALE_PORT_MASK
#define CPSW_ALE_VLAN_MASK_MUX3_REG_MASK_SHIFT                   (0x00000000U)
#define CPSW_ALE_VLAN_MASK_MUX3_REG_MASK_MAX                     CPSW_ALE_PORT_MASK

/* VLAN_MASK_MUX4_REG */

#define CPSW_ALE_VLAN_MASK_MUX4_REG_MASK_MASK                    CPSW_ALE_PORT_MASK
#define CPSW_ALE_VLAN_MASK_MUX4_REG_MASK_SHIFT                   (0x00000000U)
#define CPSW_ALE_VLAN_MASK_MUX4_REG_MASK_MAX                     CPSW_ALE_PORT_MASK

