TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Ale.h
/* VLAN_MASK_MUX5_REG */

#define CPSW_ALE_VLAN_MASK_MUX5_REG_MASK_MASK                    CPSW_ALE_PORT_MASK
#define CPSW_ALE_VLAN_MASK_MUX5_REG_MASK_SHIFT                   (0x00000000U)
#define CPSW_ALE_VLAN_MASK_MUX5_REG_MASK_MAX                     CPSW_ALE_PORT_MASK

/* VLAN_MASK_MUX6_REG */

#define CPSW_ALE_VLAN_MASK_MUX6_REG_MASK_MASK                    CPSW_ALE_PORT_MASK
#define CPSW_ALE_VLAN_MASK_MUX6_REG_MASK_SHIFT                   (0x00000000U)
#define CPSW_ALE_VLAN_MASK_MUX6_REG_MASK_MAX                     CPSW_ALE_PORT_MASK

/* VLAN_MASK_MUX7_REG */

#define CPSW_ALE_VLAN_MASK_MUX7_REG_MASK_MASK                    CPSW_ALE_PORT_MASK
#define CPSW_ALE_VLAN_MASK_MUX7_REG_MASK_SHIFT                   (0x00000000U)
#define CPSW_ALE_VLAN_MASK_MUX7_REG_MASK_MAX                     CPSW_ALE_PORT_MASK

/* POLICER_PORT_OUI_REG */

#define CPSW_ALE_POLICER_PORT_OUI_REG_PORT_MEN_MASK              (0x80000000U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_PORT_MEN_SHIFT             (0x0000001FU)
#define CPSW_ALE_POLICER_PORT_OUI_REG_PORT_MEN_MAX               (0x00000001U)

#define CPSW_ALE_POLICER_PORT_OUI_REG_TRUNK_ID_MASK              (0x40000000U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_TRUNK_ID_SHIFT             (0x0000001EU)
#define CPSW_ALE_POLICER_PORT_OUI_REG_TRUNK_ID_MAX               (0x00000001U)

#define CPSW_ALE_POLICER_PORT_OUI_REG_PORT_NUM_MASK              (0x02000000U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_PORT_NUM_SHIFT             (0x00000019U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_PORT_NUM_MAX               (0x00000001U)

#define CPSW_ALE_POLICER_PORT_OUI_REG_PRI_MEN_MASK               (0x00080000U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_PRI_MEN_SHIFT              (0x00000013U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_PRI_MEN_MAX                (0x00000001U)

#define CPSW_ALE_POLICER_PORT_OUI_REG_PRI_VAL_MASK               (0x00070000U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_PRI_VAL_SHIFT              (0x00000010U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_PRI_VAL_MAX                (0x00000007U)

#define CPSW_ALE_POLICER_PORT_OUI_REG_OUI_MEN_MASK               (0x00008000U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_OUI_MEN_SHIFT              (0x0000000FU)
#define CPSW_ALE_POLICER_PORT_OUI_REG_OUI_MEN_MAX                (0x00000001U)

#define CPSW_ALE_POLICER_PORT_OUI_REG_OUI_INDEX_MASK             (0x0000003FU)
#define CPSW_ALE_POLICER_PORT_OUI_REG_OUI_INDEX_SHIFT            (0x00000000U)
#define CPSW_ALE_POLICER_PORT_OUI_REG_OUI_INDEX_MAX              (0x0000003FU)

/* POLICER_DA_SA_REG */

#define CPSW_ALE_POLICER_DA_SA_REG_DST_MEN_MASK                  (0x80000000U)
#define CPSW_ALE_POLICER_DA_SA_REG_DST_MEN_SHIFT                 (0x0000001FU)
#define CPSW_ALE_POLICER_DA_SA_REG_DST_MEN_MAX                   (0x00000001U)

#define CPSW_ALE_POLICER_DA_SA_REG_DST_INDEX_MASK                (0x003F0000U)
#define CPSW_ALE_POLICER_DA_SA_REG_DST_INDEX_SHIFT               (0x00000010U)
#define CPSW_ALE_POLICER_DA_SA_REG_DST_INDEX_MAX                 (0x0000003FU)

#define CPSW_ALE_POLICER_DA_SA_REG_SRC_MEN_MASK                  (0x00008000U)
#define CPSW_ALE_POLICER_DA_SA_REG_SRC_MEN_SHIFT                 (0x0000000FU)
#define CPSW_ALE_POLICER_DA_SA_REG_SRC_MEN_MAX                   (0x00000001U)

#define CPSW_ALE_POLICER_DA_SA_REG_SRC_INDEX_MASK                (0x0000003FU)
#define CPSW_ALE_POLICER_DA_SA_REG_SRC_INDEX_SHIFT               (0x00000000U)
#define CPSW_ALE_POLICER_DA_SA_REG_SRC_INDEX_MAX                 (0x0000003FU)

/* POLICER_VLAN_REG */

#define CPSW_ALE_POLICER_VLAN_REG_OVLAN_MEN_MASK                 (0x80000000U)
#define CPSW_ALE_POLICER_VLAN_REG_OVLAN_MEN_SHIFT                (0x0000001FU)
#define CPSW_ALE_POLICER_VLAN_REG_OVLAN_MEN_MAX                  (0x00000001U)

#define CPSW_ALE_POLICER_VLAN_REG_OVLAN_INDEX_MASK               (0x003F0000U)
#define CPSW_ALE_POLICER_VLAN_REG_OVLAN_INDEX_SHIFT              (0x00000010U)
#define CPSW_ALE_POLICER_VLAN_REG_OVLAN_INDEX_MAX                (0x0000003FU)

#define CPSW_ALE_POLICER_VLAN_REG_IVLAN_MEN_MASK                 (0x00008000U)
#define CPSW_ALE_POLICER_VLAN_REG_IVLAN_MEN_SHIFT                (0x0000000FU)
#define CPSW_ALE_POLICER_VLAN_REG_IVLAN_MEN_MAX                  (0x00000001U)

#define CPSW_ALE_POLICER_VLAN_REG_IVLAN_INDEX_MASK               (0x0000003FU)
#define CPSW_ALE_POLICER_VLAN_REG_IVLAN_INDEX_SHIFT              (0x00000000U)
#define CPSW_ALE_POLICER_VLAN_REG_IVLAN_INDEX_MAX                (0x0000003FU)

/* POLICER_ETHERTYPE_IPSA_REG */

#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_ETHERTYPE_MEN_MASK   (0x80000000U)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_ETHERTYPE_MEN_SHIFT  (0x0000001FU)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_ETHERTYPE_MEN_MAX    (0x00000001U)

#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_ETHERTYPE_INDEX_MASK (0x003F0000U)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_ETHERTYPE_INDEX_SHIFT (0x00000010U)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_ETHERTYPE_INDEX_MAX  (0x0000003FU)

#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_IPSRC_MEN_MASK       (0x00008000U)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_IPSRC_MEN_SHIFT      (0x0000000FU)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_IPSRC_MEN_MAX        (0x00000001U)

#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_IPSRC_INDEX_MASK     (0x0000003FU)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_IPSRC_INDEX_SHIFT    (0x00000000U)
#define CPSW_ALE_POLICER_ETHERTYPE_IPSA_REG_IPSRC_INDEX_MAX      (0x0000003FU)

/* POLICER_IPDA_REG */

#define CPSW_ALE_POLICER_IPDA_REG_IPDST_MEN_MASK                 (0x80000000U)
#define CPSW_ALE_POLICER_IPDA_REG_IPDST_MEN_SHIFT                (0x0000001FU)
#define CPSW_ALE_POLICER_IPDA_REG_IPDST_MEN_MAX                  (0x00000001U)

#define CPSW_ALE_POLICER_IPDA_REG_IPDST_INDEX_MASK               (0x003F0000U)
#define CPSW_ALE_POLICER_IPDA_REG_IPDST_INDEX_SHIFT              (0x00000010U)
#define CPSW_ALE_POLICER_IPDA_REG_IPDST_INDEX_MAX                (0x0000003FU)

/* POLICER_PIR_REG */

#define CPSW_ALE_POLICER_PIR_REG_PRI_IDLE_INC_VAL_MASK           (0xFFFFFFFFU)
#define CPSW_ALE_POLICER_PIR_REG_PRI_IDLE_INC_VAL_SHIFT          (0x00000000U)
#define CPSW_ALE_POLICER_PIR_REG_PRI_IDLE_INC_VAL_MAX            (0xFFFFFFFFU)

