TexasInstruments/mcal_am263x/mcal/Eth/src/hw/Hw_Cpsw_Ale.h
/* POLICER_CIR_REG */

#define CPSW_ALE_POLICER_CIR_REG_CIR_IDLE_INC_VAL_MASK           (0xFFFFFFFFU)
#define CPSW_ALE_POLICER_CIR_REG_CIR_IDLE_INC_VAL_SHIFT          (0x00000000U)
#define CPSW_ALE_POLICER_CIR_REG_CIR_IDLE_INC_VAL_MAX            (0xFFFFFFFFU)

/* POLICER_TBL_CTL_REG */

#define CPSW_ALE_POLICER_TBL_CTL_REG_WRITE_ENABLE_MASK           (0x80000000U)
#define CPSW_ALE_POLICER_TBL_CTL_REG_WRITE_ENABLE_SHIFT          (0x0000001FU)
#define CPSW_ALE_POLICER_TBL_CTL_REG_WRITE_ENABLE_MAX            (0x00000001U)

#define CPSW_ALE_POLICER_TBL_CTL_REG_POL_TBL_INDEX_MASK          (0x00000007U)
#define CPSW_ALE_POLICER_TBL_CTL_REG_POL_TBL_INDEX_SHIFT         (0x00000000U)
#define CPSW_ALE_POLICER_TBL_CTL_REG_POL_TBL_INDEX_MAX           (0x00000007U)

/* POLICER_CTL_REG */

#define CPSW_ALE_POLICER_CTL_REG_POL_EN_MASK                     (0x80000000U)
#define CPSW_ALE_POLICER_CTL_REG_POL_EN_SHIFT                    (0x0000001FU)
#define CPSW_ALE_POLICER_CTL_REG_POL_EN_MAX                      (0x00000001U)

#define CPSW_ALE_POLICER_CTL_REG_RED_DROP_EN_MASK                (0x20000000U)
#define CPSW_ALE_POLICER_CTL_REG_RED_DROP_EN_SHIFT               (0x0000001DU)
#define CPSW_ALE_POLICER_CTL_REG_RED_DROP_EN_MAX                 (0x00000001U)

#define CPSW_ALE_POLICER_CTL_REG_YELLOW_DROP_EN_MASK             (0x10000000U)
#define CPSW_ALE_POLICER_CTL_REG_YELLOW_DROP_EN_SHIFT            (0x0000001CU)
#define CPSW_ALE_POLICER_CTL_REG_YELLOW_DROP_EN_MAX              (0x00000001U)

#define CPSW_ALE_POLICER_CTL_REG_YELLOW_THRESH_MASK              (0x07000000U)
#define CPSW_ALE_POLICER_CTL_REG_YELLOW_THRESH_SHIFT             (0x00000018U)
#define CPSW_ALE_POLICER_CTL_REG_YELLOW_THRESH_MAX               (0x00000007U)

#define CPSW_ALE_POLICER_CTL_REG_POL_MATCH_MODE_MASK             (0x00C00000U)
#define CPSW_ALE_POLICER_CTL_REG_POL_MATCH_MODE_SHIFT            (0x00000016U)
#define CPSW_ALE_POLICER_CTL_REG_POL_MATCH_MODE_MAX              (0x00000003U)

/* POLICER_TEST_CTL_REG */

#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_MASK               (0x80000000U)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_SHIFT              (0x0000001FU)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_MAX                (0x00000001U)

#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_RED_MASK           (0x40000000U)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_RED_SHIFT          (0x0000001EU)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_RED_MAX            (0x00000001U)

#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_YELLOW_MASK        (0x20000000U)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_YELLOW_SHIFT       (0x0000001DU)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_YELLOW_MAX         (0x00000001U)

#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_SELECTED_MASK      (0x10000000U)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_SELECTED_SHIFT     (0x0000001CU)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_CLR_SELECTED_MAX       (0x00000001U)

#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_TEST_ENTRY_MASK        (0x00000007U)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_TEST_ENTRY_SHIFT       (0x00000000U)
#define CPSW_ALE_POLICER_TEST_CTL_REG_POL_TEST_ENTRY_MAX         (0x00000007U)

/* POLICER_HIT_STATUS_REG */

#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_MASK             (0x80000000U)
#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_SHIFT            (0x0000001FU)
#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_MAX              (0x00000001U)

#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_RED_MASK         (0x40000000U)
#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_RED_SHIFT        (0x0000001EU)
#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_RED_MAX          (0x00000001U)

#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_YELLOW_MASK      (0x20000000U)
#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_YELLOW_SHIFT     (0x0000001DU)
#define CPSW_ALE_POLICER_HIT_STATUS_REG_POL_HIT_YELLOW_MAX       (0x00000001U)

/* THREAD_DEF_REG */

#define CPSW_ALE_THREAD_DEF_REG_ENABLE_MASK                      (0x00008000U)
#define CPSW_ALE_THREAD_DEF_REG_ENABLE_SHIFT                     (0x0000000FU)
#define CPSW_ALE_THREAD_DEF_REG_ENABLE_MAX                       (0x00000001U)

#define CPSW_ALE_THREAD_DEF_REG_VALUE_MASK                       (0x0000003FU)
#define CPSW_ALE_THREAD_DEF_REG_VALUE_SHIFT                      (0x00000000U)
#define CPSW_ALE_THREAD_DEF_REG_VALUE_MAX                        (0x0000003FU)

/* THREAD_CTL_REG */

#define CPSW_ALE_THREAD_CTL_REG_ENTRY_PTR_MASK                   (0x00000007U)
#define CPSW_ALE_THREAD_CTL_REG_ENTRY_PTR_SHIFT                  (0x00000000U)
#define CPSW_ALE_THREAD_CTL_REG_ENTRY_PTR_MAX                    (0x00000007U)

/* THREAD_VAL_REG */

#define CPSW_ALE_THREAD_VAL_REG_ENABLE_MASK                      (0x00008000U)
#define CPSW_ALE_THREAD_VAL_REG_ENABLE_SHIFT                     (0x0000000FU)
#define CPSW_ALE_THREAD_VAL_REG_ENABLE_MAX                       (0x00000001U)

#define CPSW_ALE_THREAD_VAL_REG_VALUE_MASK                       (0x0000003FU)
#define CPSW_ALE_THREAD_VAL_REG_VALUE_SHIFT                      (0x00000000U)
#define CPSW_ALE_THREAD_VAL_REG_VALUE_MAX                        (0x0000003FU)

#ifdef __cplusplus
}
#endif
#endif  /* HW_CPSW_ALE_H_ */

